tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Needs to be installed first as other packages depend on it
cask "adoptopenjdk"

brew "antibody"
brew "openssl@1.1"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "curl"
brew "dnsmasq"
brew "editorconfig"
brew "fzf"
brew "git"
brew "git-lfs"
brew "python"
brew "gnupg", link: false
brew "highlight"
brew "hopenpgp-tools"
brew "hub"
brew "imagemagick"
brew "imageoptim-cli"
brew "less"
brew "libxslt"
brew "mas"
brew "neovim"
brew "node"
brew "packer"
brew "php"
brew "plantuml"
brew "reattach-to-user-namespace"
brew "ruby"
brew "sops"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "whalebrew"
brew "yarn"
brew "ykman"
cask "bartender"
cask "carbon-copy-cloner"
cask "chromedriver"
cask "daisydisk"
cask "dash"
cask "docker-edge"
cask "font-input"
cask "google-chrome"
cask "gpg-suite"
cask "imageoptim"
cask "intel-power-gadget"
cask "istat-menus"
cask "kaleidoscope"
cask "kitty"
cask "little-snitch"
cask "macpass"
cask "micro-snitch"
cask "microsoft-edge-beta"
cask "paw"
cask "phpstorm"
cask "postico"
cask "qfinder-pro"
cask "safari-technology-preview"
cask "secure-pipes"
cask "sequel-pro-nightly"
cask "sqleditor"
cask "steam"
cask "transmit"
cask "tunnelbear"
cask "vagrant"
cask "vagrant-manager"
cask "versions"
cask "vimr"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vmware-fusion"
mas "Acorn", id: 1233861775
mas "Amphetamine", id: 937984704
mas "Base", id: 402383384
mas "Calcbot", id: 931657367
mas "Canary Mail", id: 1236045954
mas "CCMenu", id: 603117688
mas "Deliveries", id: 924726344
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Magnet", id: 441258766
mas "MCG", id: 799178412
mas "Medis", id: 1063631769
mas "New File Menu", id: 1064959555
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Reeder", id: 1449412482
mas "Roadblock", id: 1051436753
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Swiftify for Xcode", id: 1183412116
mas "Table Tool", id: 1122008420
mas "The Clock", id: 488764545
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
