tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "editorconfig"
brew "fzf"
brew "git"
brew "git-lfs"
brew "python"
brew "highlight"
brew "mas"
brew "neovim"
brew "node"
brew "packer"
brew "php"
brew "python@2"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"

cask "docker-edge"
cask "font-input"
cask "kaleidoscope"
cask "kitty"
cask "sequel-pro-nightly"
cask "vagrant"
cask "vagrant-manager"
cask "vimr"
cask "virtualbox"
cask "virtualbox-extension-pack"

mas "Amphetamine", id: 937984704
mas "CCMenu", id: 603117688
mas "Magnet", id: 441258766
mas "Medis", id: 1063631769
mas "OmniGraffle", id: 1142578753
mas "Roadblock", id: 1051436753
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
