tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Needs to be installed first as other packages depend on it
cask "adoptopenjdk"

brew "antibody"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "curl"
brew "dnsmasq"
brew "editorconfig"
brew "fzf"
brew "git"
brew "git-lfs"
brew "python"
brew "gnupg"
brew "highlight"
brew "hub"
brew "imagemagick"
brew "less"
brew "libxslt"
brew "mas"
brew "neovim"
brew "node"
brew "openssl"
brew "packer"
brew "php"
brew "pinentry-mac"
brew "plantuml"
brew "python@2"
brew "reattach-to-user-namespace"
brew "ruby"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "yarn"
brew "zsh"

cask "docker-edge"
cask "font-input"
cask "gpg-suite"
cask "kaleidoscope"
cask "kitty"
cask "microsoft-edge-beta"
cask "paw"
cask "phpstorm"
cask "sequel-pro-nightly"
cask "vagrant"
cask "vagrant-manager"
cask "vimr"
cask "virtualbox"
cask "virtualbox-extension-pack"

mas "Amphetamine", id: 937984704
mas "Base", id: 402383384
mas "CCMenu", id: 603117688
mas "Magnet", id: 441258766
mas "Medis", id: 1063631769
mas "OmniGraffle", id: 1142578753
mas "Roadblock", id: 1051436753
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
